#===istalismanplugin===
# -*- coding: utf-8 -*-

REGION = """
 Республика Адыгея - 01
 Республика Башкортостан - 02
 Республика Бурятия - 03
 Республика Горный Алтай - 04
 Республика Дагестан - 05
 Ингушская Республика - 06
 Кабардино-Балкарская Республика - 07
 Республика Калмыкия - 08
 Карачаево-Черкесская Республика - 09
 Республика Карелия - 10
 Республика Коми - 11
 Республика Марий Эл - 12
 Мордовская Республика - 13
 Республика Саха (Якутия) - 14
 Северо-Осетинская Республика - 15
 Республика Татарстан - 16
 Республика Тува - 17
 Удмуртская Республика - 18
 Республика Хакасия - 19
 Чеченская Республика - 20
 Чувашская Республика - 21
 Алтайский край - 22
 Краснодарский край - 23,93
 Красноярский край - 24
 Приморский край - 25
 Ставропольский край - 26
 Хабаровский край - 27
 Амурская область - 28
 Архангельская область - 29
 Астраханская область - 30
 Белгородская область - 31
 Брянская область - 32
 Владимирская область - 33
 Волгоградская область - 34
 Вологодская область - 35
 Воронежская область - 36
 Ивановская область - 37
 Иркутская область - 38
 Калининградская область - 39
 Калужская область - 40
 Камчатская область - 41
 Кемеровская область - 42
 Кировская область - 43
 Костромская область - 44
 Курганская область - 45
 Курская область - 46
 Ленинградская область - 47
 Липецкая область - 48
 Магаданская область - 49
 Московская область - 50, 90, 150
 Мурманская область - 51
 Нижегородская область - 52
 Новгородская область - 53
 Новосибирская область - 54
 Омская область - 55
 Оренбургская область - 56
 Орловская область - 57
 Пензенская область - 58
 Пермская область - 59
 Псковская область - 60
 Ростовская область - 61
 Рязанская область - 62
 Самарская область - 63, 163
 Саратовская область - 64
 Сахалинская область - 65
 Свердловская область - 66,96
 Смоленская область - 67
 Тамбовская область - 68
 Тверская область - 69
 Томская область - 70
 Тульская область - 71
 Тюменская область - 72
 Ульяновская область - 73
 Челябинская область - 74
 Читинская область - 75
 Ярославская область - 76
 Москва - 77, 99, 97, 177
 Санкт-Петербург - 78, 98, 178
 Еврейская автономная область - 79
 Агинский Бурятский автономный округ - 80
 Коми-Пермяцкий автономный округ - 81
 Корякский автономный округ - 82
 Ненецкий автономный округ - 83
 Таймырский автономный округ - 84
 Усть-Ордынский автономный округ - 85
 Ханты-Мансийский автономный округ - 86
 Чукотский автономный округ - 87
 Эвенкийский автономный округ - 88
 Ямало-Ненецкий автономный округ - 89"""

def hnd_region(type, source, parameters):
        rep=''
        parameters=parameters.encode('utf-8','replace')
        if not parameters or parameters.isspace():
                reply(type, source, u'а номер?')
                return
        if len(parameters) in [1] and parameters.isdigit():
                parameters='0'+parameters
        sp=REGION.split('\n')
        for x in sp:
                if x.count(parameters):
                        rep+=x+'\n'
        if not rep or rep.isspace():
                reply(type, source, u'ничего не найдено!')
        reply(type, source, rep)


register_command_handler(hnd_region, '!регион', ['все', 'инфо'], 0, 'регион', 'регион номер', ['регион 48'])
